# GetLScale

## Description
Function GetLScale returns the scale of the referenced layer.&lt;BR&gt;

```pascal
FUNCTION GetLScale(h : HANDLE) : REAL;
```

```python

def vs.GetLScale(h):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from MiniCAD
## Category
* Layers